# 1. 子网划分

## 1. 子网地址的分配

**子网全部地址=子网的网络地址+广播地址+主机地址**

> 地址的所有主机位都为"0"时，这一地址为子网的网络地址，而当所有主机位都为"1"时为广播地址
>

## 2. 常用子网掩码

| 掩码位数 |    子网掩码     | IP总数 |
| :------: | :-------------: | :----: |
|   /24    |  255.255.255.0  |  256   |
|   /25    | 255.255.255.128 |   128   |
|   /26    | 255.255.255.192 |   64   |
|   /27    | 255.255.255.224 |   32   |
|   /28    | 255.255.255.240 |   16   |
|   /29    | 255.255.255.248 |   8    |
|   /30    | 255.255.255.252 |   4    |

#  2. Cisco模式及其转换

Cisco IOS提供了用户模式和特权模式两种基本的命令执行级别，同时还提供了全局配置、接口配置、Line 配置等多种级别的配置模式，以允许用户对交换机的资源进行配置和管理。

## 1. 用户模式

> Router>

当用户通过交换机的控制台端口或 Telnet 会话连接并登录到交换机时，此时所处的命令执行模式就是用户模式。在该模式下，只执行有限的一组命令，这些命令通常用于查看显示系统信息、改变终端设置和执行一些最基本的测试命令，如 `ping` 、`traceroute ` 等。

## 2. 特权模式

> Router#

特权模式主要用于调试。在特权模式下，有检查、配置、调试等所有权限，除了特定端口的配置外，其他基本功能都可以在此模式下完成。在用户模式下，执行`enable` 命令，将进入到特权模式。在该模式下，用户能够执行 IOS 提供的所有命令。

> Router>enable
> Password:
> Router#

在前面的启动配置中，设置了登录特权模式的密码，因此系统提示输入用户密码，密码输入时不回显，输入完毕按回车，密码校验通过后，即进入特权模式。若进入特权模式的密码未设置或要修改，可在全局配置模式下，利用 `enable secret` 命令进行设置。

离开特权模式，返回用户模式，可执行 `exit` 或 `disable` 命令。

## 3. 全局配置模式

> Router(config)#

全局配置模式是用来配置的，此模式可以进一步的查看交换机的配置信息和调试信息，以及作出的配置作用于全局，该配置模式下配置的内容都将作用于全局。在特权模式下，执行 `configure terminal` 命令，即可进入全局配置模式。在该模式下，只要输入一条有效的配置命令并回车，内存中正在运行的配置就会立即改变生效。该模式下的配置命令的作用域是全局性的，是对整个交换机起作用。全局配置模式的命令状态行为：

> Router#config terminal
> Router(config)#

在全局配置模式，还可进入接口配置、line配置等子模式。

1. 从子模式返回全局配置模式，执行 exit命令；
2. 从全局配置模式返回特权模式，执行exit命令；
3. 若要退出任何配置模式，直接返回特权模式，则要直接 `end` 命令或按 Ctrl+Z 组合键。

对配置进行修改后， 为了使配置在下次掉电重启后仍生效，需要将新的配置保存到NVRAM中，其配置命令为：

> Router(config)#exit
> Router#write

## 4. 接口配置模式

> Router(config-if)#

在全局配置模式下，执行 `interface` 命令，即进入接口配置模式。在该模式下，可对选定的接口（端口） 进行配置， 并且只能执行配置交换机端口的命令。

## 5. Line 配置模式

> Router(config-line)#

在全局配置模式下，执行 `line vty` 或 `line console` 命令，将进入 Line 配置模式。该模式主要用于对虚拟终端（vty ）和控制台端口进行配置，其配置主要是设置虚拟终端和控制台的用户级登录密码。

交换机有一个控制端口（console），其编号为0，通常利用该端口进行本地登录，以实现对交换机的配置和管理。进入Line 配置模式方法为 ：

> student1(config)#line console 0 
> student1(config-line)# 

退出line配置模式，执行exit命令，若要退出任何配置模式，直接返回特权模式，则要直接 end 命令或按 Ctrl+Z组合键。

![模式转换图](image/%E6%A8%A1%E5%BC%8F%E8%BD%AC%E6%8D%A2%E5%9B%BE.svg)

# 2. Cisco模式间的转换

Cisco IOS提供了用户模式和特权模式两种基本的命令执行级别，同时还提供了全局配置、接口配置、Line 配置等多种级别的配置模式，以允许用户对交换机的资源进行配置和管理。

## 1. 用户模式

> Router>

当用户通过交换机的控制台端口或 Telnet 会话连接并登录到交换机时，此时所处的命令执行模式就是用户模式。在该模式下，只执行有限的一组命令，这些命令通常用于查看显示系统信息、改变终端设置和执行一些最基本的测试命令，如 `ping` 、`traceroute ` 等。

## 2. 特权模式

> Router#

特权模式主要用于调试。在特权模式下，有检查、配置、调试等所有权限，除了特定端口的配置外，其他基本功能都可以在此模式下完成。在用户模式下，执行`enable` 命令，将进入到特权模式。在该模式下，用户能够执行 IOS 提供的所有命令。

> Router>enable
> Password:
> Router#

在前面的启动配置中，设置了登录特权模式的密码，因此系统提示输入用户密码，密码输入时不回显，输入完毕按回车，密码校验通过后，即进入特权模式。若进入特权模式的密码未设置或要修改，可在全局配置模式下，利用 `enable secret` 命令进行设置。

离开特权模式，返回用户模式，可执行 `exit` 或 `disable` 命令。

## 3. 全局配置模式

> Router(config)#

全局配置模式是用来配置的，此模式可以进一步的查看交换机的配置信息和调试信息，以及作出的配置作用于全局，该配置模式下配置的内容都将作用于全局。在特权模式下，执行 `configure terminal` 命令，即可进入全局配置模式。在该模式下，只要输入一条有效的配置命令并回车，内存中正在运行的配置就会立即改变生效。该模式下的配置命令的作用域是全局性的，是对整个交换机起作用。全局配置模式的命令状态行为：

> Router#config terminal
> Router(config)#

在全局配置模式，还可进入接口配置、line配置等子模式。

1. 从子模式返回全局配置模式，执行 exit命令；
2. 从全局配置模式返回特权模式，执行exit命令；
3. 若要退出任何配置模式，直接返回特权模式，则要直接 `end` 命令或按 Ctrl+Z 组合键。

对配置进行修改后， 为了使配置在下次掉电重启后仍生效，需要将新的配置保存到NVRAM中，其配置命令为：

> Router(config)#exit
> Router#write

## 4. 接口配置模式

> Router(config-if)#

在全局配置模式下，执行 `interface` 命令，即进入接口配置模式。在该模式下，可对选定的接口（端口） 进行配置， 并且只能执行配置交换机端口的命令。

## 5. Line 配置模式

> Router(config-line)#

在全局配置模式下，执行 `line vty` 或 `line console` 命令，将进入 Line 配置模式。该模式主要用于对虚拟终端（vty ）和控制台端口进行配置，其配置主要是设置虚拟终端和控制台的用户级登录密码。

交换机有一个控制端口（console），其编号为0，通常利用该端口进行本地登录，以实现对交换机的配置和管理。进入Line 配置模式方法为 ：

> student1(config)#line console 0 
> student1(config-line)# 

退出line配置模式，执行exit命令，若要退出任何配置模式，直接返回特权模式，则要直接 end 命令或按 Ctrl+Z组合键。

![模式转换图](image/%E6%A8%A1%E5%BC%8F%E8%BD%AC%E6%8D%A2%E5%9B%BE.svg)

# 3. 查看与检查

## 1. 当前运行配置

显示存储在内存中的当前运行配置

```
Router#show running-config
```

## 2. 接口

显示简单地接口信息

```
Router#show ip interface brief 
```

显示所有的接口配置参数和统计信息

```
Router#show interface
```

## 3. 路由表

查看路由表

```
Router#show ip route
```

# 4. 保存

## 1. startup-config

将 `running-config` 保存到 `startup-config` 作为永久性配置文件，下次开机自动加载。

```
Router#copy running-config startup-config
```

# 5. 基本配置

## 1. 主机名

设置主机名为 `R1`

```
Router(config)#hostname R1
R1(config)#
```

## 2. 强口令

将密码设置为 `class` 

```
Router(config)#enable secret class
```

退出后再次进入特权模式时则需要输入刚才设置好的密码 `class`，输入密码时， cisco 不会显示密码

> Router>
> Router>en
> Router#config t
> Enter configuration commands, one per line.  End with CNTL/Z.
> Router(config)#enable secret class
> Router(config)#exit
> Router#
> ... ...
> Router#exit
> .. ...
> Router>en
> Password: 
> Router#

##  3. [VTY](https://baike.baidu.com/item/%E8%99%9A%E6%8B%9F%E7%BB%88%E7%AB%AF/11044784?fromtitle=vty&fromid=6895751&fr=aladdin) 控制台

将控制台密码设置为 `c` 

```
Router(config)#line console 0
Router(config-line)#password c
Router(config-line)#login
Router(config-line)#
```

### 测试

#### 连接

![VTY](image/VTY-1607501505746.gif)

#### 登录

![image-20201208215924392](image/image-20201208215924392-1607501505747.png)

![image-20201208220044284](image/image-20201208220044284-1607501505747.png)

##  4. [VTY](https://baike.baidu.com/item/%E8%99%9A%E6%8B%9F%E7%BB%88%E7%AB%AF/11044784?fromtitle=vty&fromid=6895751&fr=aladdin) Telnet

将 Telnet 密码设置为 `c` 

```
Router(config)#line vty 0 4
Router(config-line)#password c
Router(config-line)#login
Router(config-line)#
```

## 5.标语

配置标语为 `motd test` 。先进入配置：

```
banner motd #
```

再输入配置内容，注意以定界符 `#` 结尾

```
motd
test#
```

注意：消息开头结尾要使用定界符 `#` ，定界符可用于配置多行标语。

> Router(config)#banner motd #
> Enter TEXT message.  End with the character '#'.
> motd
> test#
>
> Router(config)#end
> Router#
> %SYS-5-CONFIG_I: Configured from console by console
>
> Router#show run
> ... ...
> !
> !
> !
> banner motd ^C
> motd
> test^C
> !
> !
> !
> ... ...
> end

## 6. 接口

以下对接口 `FastEthernet0/0` 进行配置

### 1. 地址

配置 IP 地址为 `192.168.2.1` ，子网掩码为 255.255.255.0

```
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
```

### 2. 描述

```
Router(config-if)#description descriptionTset
```

### 3. 激活接口

```
Router(config-if)#no shutdown
```

> Router(config)#interface FastEthernet0/0
> Router(config-if)#ip address 192.168.2.1 255.255.255.0
> Router(config-if)#description descriptionTset
> Router(config-if)#no shutdown
>
> Router(config-if)#
> %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
>
> Router(config-if)#end
> Router#
> %SYS-5-CONFIG_I: Configured from console by console
>
> Router#show running-config
> ... ...
> interface FastEthernet0/0
> description descriptionTset
> ip address 192.168.2.1 255.255.255.0
> duplex auto
> speed auto
> ... ...

### 4. 保存

```
Router#copy running-config startup-config
```

> Router#show startup-config
> startup-config is not present
> Router#copy running-config startup-config
> Destination filename [startup-config]? 
> Building configuration...
> [OK]
> Router#show startup-config
> ... ...
> interface FastEthernet0/0
> description descriptionTset
> ip address 192.168.2.1 255.255.255.0
> duplex auto
> speed auto
> ... ...

### 5. 查看

```
Router#show interface
```

> Router#show interface
> FastEthernet0/0 is up, line protocol is down (disabled)
>   Hardware is Lance, address is 0004.9a58.e201 (bia 0004.9a58.e201)
>   Description: descriptionTset
>   Internet address is 192.168.2.1/24
>   MTU 1500 bytes, BW 100000 Kbit, DLY 100 usec,
>      reliability 255/255, txload 1/255, rxload 1/255
>   Encapsulation ARPA, loopback not set
>   Full-duplex, 100Mb/s, media type is RJ45
>   ARP type: ARPA, ARP Timeout 04:00:00, 
>   Last input 00:00:08, output 00:00:05, output hang never
>   Last clearing of "show interface" counters never
>   Input queue: 0/75/0 (size/max/drops); Total output drops: 0
>   Queueing strategy: fifo
>   Output queue :0/40 (size/max)
>   5 minute input rate 0 bits/sec, 0 packets/sec
>   5 minute output rate 0 bits/sec, 0 packets/sec
>      0 packets input, 0 bytes, 0 no buffer
>      Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
>      0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
>      0 input packets with dribble condition detected
>      0 packets output, 0 bytes, 0 underruns
>      0 output errors, 0 collisions, 1 interface resets
>      0 babbles, 0 late collision, 0 deferred
>      0 lost carrier, 0 no carrier
>      0 output buffer failures, 0 output buffers swapped out
> FastEthernet0/1 is administratively down, line protocol is down (disabled)
>   Hardware is Lance, address is 0004.9a58.e202 (bia 0004.9a58.e202)
>   MTU 1500 bytes, BW 100000 Kbit, DLY 100 usec,
>      reliability 255/255, txload 1/255, rxload 1/255
>   Encapsulation ARPA, loopback not set
>   Full-duplex, 100Mb/s, media type is RJ45
>   ARP type: ARPA, ARP Timeout 04:00:00, 
>   Last input 00:00:08, output 00:00:05, output hang never
>   Last clearing of "show interface" counters never
>   Input queue: 0/75/0 (size/max/drops); Total output drops: 0
>   Queueing strategy: fifo
>   Output queue :0/40 (size/max)
>   5 minute input rate 0 bits/sec, 0 packets/sec
>   5 minute output rate 0 bits/sec, 0 packets/sec
>      0 packets input, 0 bytes, 0 no buffer
>      Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
>      0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
>      0 input packets with dribble condition detected
>      0 packets output, 0 bytes, 0 underruns
>      0 output errors, 0 collisions, 1 interface resets
>      0 babbles, 0 late collision, 0 deferred
>      0 lost carrier, 0 no carrier
>      0 output buffer failures, 0 output buffers swapped out
> Vlan1 is administratively down, line protocol is down
>   Hardware is CPU Interface, address is 0006.2acd.1599 (bia 0006.2acd.1599)
>   MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec,
>      reliability 255/255, txload 1/255, rxload 1/255
>   Encapsulation ARPA, loopback not set
>   ARP type: ARPA, ARP Timeout 04:00:00
>   Last input 21:40:21, output never, output hang never
>   Last clearing of "show interface" counters never
>   Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
>   Queueing strategy: fifo
>   Output queue: 0/40 (size/max)
>   5 minute input rate 0 bits/sec, 0 packets/sec
>   5 minute output rate 0 bits/sec, 0 packets/sec
>      1682 packets input, 530955 bytes, 0 no buffer
>      Received 0 broadcasts (0 IP multicast)
>      0 runts, 0 giants, 0 throttles
>      0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
>      563859 packets output, 0 bytes, 0 underruns
>      0 output errors, 23 interface resets
>      0 output buffer failures, 0 output buffers swapped out
>
> Router#





